In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
data = pd.read_csv('C:\\Users\\shariq\\OneDrive\\Data Analysis Git\\Churn_Modelling\\churn_modelling.csv')

In [3]:
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
DataFrame(data.head())

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [5]:
data.shape
# 10000 row, 14 columns

(10000, 14)

In [6]:
# how to see all the colums in our data set
data.columns

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

In [7]:
# we want to drop some of the columns,so, we dropped columns exited and tenure
# axis = 0 : row, axis = 1 : columns
new_data = data.drop(['Tenure','Exited'],axis = 1)

In [8]:
new_data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,1,15634602,Hargrave,619,France,Female,42,0.00,1,1,1,101348.88
1,2,15647311,Hill,608,Spain,Female,41,83807.86,1,0,1,112542.58
2,3,15619304,Onio,502,France,Female,42,159660.80,3,1,0,113931.57
3,4,15701354,Boni,699,France,Female,39,0.00,2,0,0,93826.63
4,5,15737888,Mitchell,850,Spain,Female,43,125510.82,1,1,1,79084.10

In [9]:
print("New Data:  ",new_data.shape)
print("Old:  ",data.shape)
# have you notice that we have no change in old data (in numpy copy's change also reflect to the original) because
# inplace by deafult is False, if we true it, it will be replaced all the values.

New Data:   (10000, 12)
Old:   (10000, 14)

In [10]:
# selecting any perticular columns
df_sepc = pd.read_csv('C:\\Users\\shariq\\OneDrive\\Data Analysis Git\\Churn_Modelling\\churn_modelling.csv',usecols=['Gender','Age',
'Tenure','Balance'])
df_sepc.head(10)

   Gender  Age  Tenure    Balance
0  Female   42       2       0.00
1  Female   41       1   83807.86
2  Female   42       8  159660.80
3  Female   39       1       0.00
4  Female   43       2  125510.82
5    Male   44       8  113755.78
6    Male   50       7       0.00
7  Female   29       4  115046.74
8    Male   44       4  142051.07
9    Male   27       2  134603.88

In [11]:
# We can select length of row 
df_partial = pd.read_csv('C:\\Users\\shariq\\OneDrive\\Data Analysis Git\\Churn_Modelling\\churn_modelling.csv',nrows=500)
df_partial.shape

(500, 14)

In [12]:
df_partial.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

## Sample 
` after creating a dataframe, we many want ot daw a small sample to work. we can either use the n parameter 
or frac parameter to determine the sample size `

In [13]:
df_sample = data.sample(n=1000)
df_sample.shape

(1000, 14)

In [14]:
# frac: is the ration of the sample size to whole data
df_sample2 = data.sample(frac=0.01)
df_sample2.shape

(100, 14)

## checking missing value

In [15]:
data.isna().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

## Adding missing values loc and iloc
- loc: selects with label 
- iloc: slects with index

In [16]:
random_index = np.random.randint(10000,size = 20 )

In [17]:
random_index

array([2729, 8712, 4715,  628, 1018, 4300, 5365, 6951, 1743, 7594, 9140,
        110, 4465, 4012, 9229,  539, 5837, 5897, 8525, 4791])

In [18]:
data.loc[random_index,['Balance','Geography',]] = np.nan

In [19]:
data.isna().sum()

RowNumber           0
CustomerId          0
Surname             0
CreditScore         0
Geography          20
Gender              0
Age                 0
Tenure              0
Balance            20
NumOfProducts       0
HasCrCard           0
IsActiveMember      0
EstimatedSalary     0
Exited              0
dtype: int64

In [20]:
data.iloc[random_index,-1] = np.nan

In [21]:
data.isna().sum()

RowNumber           0
CustomerId          0
Surname             0
CreditScore         0
Geography          20
Gender              0
Age                 0
Tenure              0
Balance            20
NumOfProducts       0
HasCrCard           0
IsActiveMember      0
EstimatedSalary     0
Exited             20
dtype: int64

### Filling Missing Values

In [22]:
mode = data['Geography'].value_counts()
mode

France     5005
Germany    2503
Spain      2472
Name: Geography, dtype: int64

In [23]:
mode = data['Geography'].value_counts().index[0]

In [24]:
mode

'France'

In [25]:
data['Geography'].fillna(value= mode)

0        France
1         Spain
2        France
3        France
4         Spain
5         Spain
6        France
7       Germany
8        France
9        France
10       France
11        Spain
12       France
13       France
14        Spain
15      Germany
16      Germany
17        Spain
18        Spain
19       France
20       France
21        Spain
22        Spain
23       France
24       France
25       France
26      Germany
27       France
28      Germany
29       France
         ...
9970     France
9971     France
9972     France
9973     France
9974     France
9975    Germany
9976     France
9977     France
9978     France
9979     France
9980      Spain
9981    Germany
9982    Germany
9983     France
9984    Germany
9985     France
9986    Germany
9987      Spain
9988     France
9989      Spain
9990    Germany
9991     France
9992      Spain
9993     France
9994     France
9995     France
9996     France
9997     France
9998    Germany
9999     France
Name: Geography, Length: 10000, dtype: object

In [26]:
data['Geography'].fillna(value= mode,inplace  = True)

In [27]:
data['Geography'].value_counts()

France     5025
Germany    2503
Spain      2472
Name: Geography, dtype: int64

In [28]:
avg = data['Balance'].mean()
data['Balance'].fillna(value = avg,inplace = True)

## Dropping Missing Values

In [29]:
data.dropna(axis=0,how='any',inplace=True)

In [30]:
data.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1.0
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0.0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1.0
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0.0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0.0
5,6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1.0
6,7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0.0
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1.0
8,9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0.0
9,10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0.0

In [31]:
data.isna().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [32]:
data.isna().sum().sum()

0

## Selectiong Rows Based on conditions

In [33]:
france_churn = data[(data.Geography == 'France') & (data.Exited == 1)]
france_churn.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1.0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1.0
35,36,15794171,Lombardo,475,France,Female,45,0,134264.04,1,1,0,27822.99,1.0
41,42,15738148,Clarke,465,France,Female,51,8,122522.32,1,0,0,181297.65,1.0
43,44,15755196,Lavine,834,France,Female,49,2,131394.56,1,0,0,194365.76,1.0

In [34]:
france_churn.Geography.value_counts()

France    809
Name: Geography, dtype: int64